cases/annulus_refined/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    cyclicLeft
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          300;
        startFace       63460;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  cyclicRight;
    }
    cyclicRight
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          300;
        startFace       63760;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  cyclicLeft;
    }
    innerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          240;
        startFace       64060;
    }
    outerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          240;
        startFace       64300;
    }
    cyclicSideFront
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          8000;
        startFace       64540;
        matchTolerance  0.0001;
        transform       rotational;
        neighbourPatch  cyclicSideBack;
        rotationAxis    (1 0 0);
        rotationCentre  (0 0 0);
        AMIMethod       faceAreaWeightAMI;
        restartUncoveredSourceFace 1;
    }
    cyclicSideBack
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          8000;
        startFace       72540;
        matchTolerance  0.0001;
        transform       rotational;
        neighbourPatch  cyclicSideFront;
        rotationAxis    (1 0 0);
        rotationCentre  (0 0 0);
        AMIMethod       faceAreaWeightAMI;
        restartUncoveredSourceFace 1;
    }
)

// ************************************************************************* //
